#1.请循环遍历出所有的key
#2.请循环遍历出所有的value
dict={"k1":"v1","k2":"v2","k3":"v3"}
#遍历出所有的key值
for dic in dict.keys():
    print(dic)
#遍历出所有的value
for dic in dict:
    print(dict[dic])





# 3.请在字典中增加一个键值对,"k4":"v4"
dict={"k1":"v1","k2":"v2","k3":"v3"}
dict["k4"]="v4"
print(dict)
#小明，小刚去超市里购买水果
#小明购买了苹果，草莓，香蕉，小刚购买了葡萄，橘子，樱桃，请从下面的描述的字典中，计算每个人花费的金额，并写入到money字段里。
#以姓名做key，value仍然是字典info={
    "小明":{"水果":{"苹果":12.3,"草莓":4.5,"香蕉":6.3},
          "money":23.1
           },
    "小刚":{"水果": {"葡萄":5.8,"橘子":6.4,"樱桃":15.8},
          "money":28
          }
     }
print()





#4.编写一个函数，传入一个列表，并统计每个数字出现的次数。返回字典数据：{21:3,56:9,10:3}   （阿里一轮笔试题）
list=[(21,3),(56,9),(10,3)]
new_dict={}
for i in list:
    new_dict[i[0]]=i[1]
print(new_dict)
from collections import Counter
def counter(list):
    return Counter(list)
print(counter(list))





#5.有以下公司员工信息，将数据转换为字典方式（姓名作为键，其他作为值,张三:{xxx:xxx,xx:xxx}）
people={
    "刘备":{
        "年龄":"56",
        "性别":"男",
        "编号":"106",
        "任职公司":"IBM",
        "薪资":500 ,
        "部门编号":"50"},
    "大乔":{
        "年龄":"19",
        "性别":"女",
        "编号":"230",
        "任职公司":"微软",
        "薪资":501 ,
        "部门编号":"60"},
    "小乔":{
        "年龄":"19",
        "性别":"女",
        "编号":"210",
        "任职公司":"Oracle",
        "薪资":600,
        "部门编号":"60"},
    "张飞":{
        "年龄":"45",
        "性别":"男",
        "编号":"230",
        "任职公司":"Tencent",
        "薪资":700 ,
        "部门编号":"10"}
}
print(people)
